> (= foo (new-namespace (new-namespace (new-namespace)) (new-namespace)))
#(tagged namespace {#<namespace:0> #<namespace:0> #<namespace:0> #<namespace:0>})

> foo!bar
nil

> (= foo!bar 10)
10

> foo!bar
10

> foo!qux
nil


> (eval-w/ (new-namespace) foo)
error: undefined variable: foo


> (= bar (new-namespace arc3-namespace))

> (eval-w/ bar foo)
#(tagged namespace {#<namespace:0> #<namespace:0> #<namespace:0> #<namespace:0>})

> (eval-w/ bar (= foo 10))
10

> (eval-w/ bar foo)
10

> foo
#(tagged namespace {#<namespace:0> #<namespace:0> #<namespace:0> #<namespace:0>})


;> (w/namespace bar (eval '(= foo 10)))
10

;> (w/namespace bar foo)
10

;> foo
#(tagged namespace {#<namespace:0> #<namespace:0> #<namespace:0> #<namespace:0>})


> (= foo (new-namespace namespace))
#(tagged namespace {#<namespace:0> #<namespace:0>})

> (= bar (new-namespace foo))
#(tagged namespace {#<namespace:0> #<namespace:0> #<namespace:0>})

> (eval-w/ foo
    (def foo (x)
      (bar x))
    (def bar (x)
      x))
#<fn>

> (eval-w/ bar
    (foo 50))
50

> (eval-w/ bar
    (def bar (x)
      10)
    (foo 50))
50

> (eval-w/ foo
    (dynamic bar bar))
#<fn:bar>

> (eval-w/ bar
    (foo 50))
10

> (eval-w/ foo
    (foo 50))
50


;=============================================================================
;  Dynamic variables
;=============================================================================

> (dynamic foo 5)
5

> foo
5

> (= foo 10)
10

> foo
10


;=============================================================================
;  Implicit namespace creation
;=============================================================================

> (def nou ())
#<fn:nou>

> namespace
#<namespace:0>

> (def nou ())
#<fn:nou>

> namespace
#(tagged namespace {#<namespace:0> #<namespace:0>})
