> (w/arc3 (import time))
 loading:  time.arc
 skipping: strings.arc
nil

> (w/arc3 (timeit-range (+ 1 2) 390000 #|3097468|#))
t

> (timeit-range (+ 1 2) 62000 #|638625|#)
t


> (timeit-range 'foo 680000)
t


> (timeit-range (apply idfn (list 'x)) 20500)
t

> (timeit-range (idfn 'x) 61000)
t


> (timeit-range (do 1 2 3) 690000)
t

> (timeit-range (< 1 2) 61000)
t
