> (w/arc3 (import time))
 loading:  time.arc
 skipping: strings.arc
nil

> (w/arc3 (timeit-range (+ 1 2) 300000 #|3097468|#))
t

> (timeit-range (+ 1 2) 62000 #|638625|#)
t


> (timeit-range 'foo 370000)
t


> (timeit-range (apply idfn (list 'x)) 19000)
t

> (timeit-range (idfn 'x) 51500)
t


> (timeit-range (do 1 2 3) 370000)
t
